i = 0
N= 3
while i < N:
    print("уже приехали?")
    print("нет!!!")
    i+=1
else:
    print("приехали")
#=============================================================
a = ["яблоко","лук","чеснок","помидор"]
i=0
while i < len(a):
    if a[i] == "лук":
        print("ФУ ЛУК!")
        i+=1
        continue
    if a[i] == "чеснок":
        print("фу чеснок?")
        break
    print(a[i])
    i += 1
else:
    print("из-за брейк не сработает")
#=============================================================
a = [123, 123123, 4234234, 5454]
for x in a:
    print(x)
#=============================================================
for x in range(0, 10, 2):
    print(x)