# ввод и вывод в косоли:
print('Можно', 'использовать', 'сепаратор', 'например', 'sep="/"', sep="/")
print("Обычный", "сепаратор", "это", "' '")

print("======================================================================")
print("Символ конца строки end = ' '.", end=" ")
print("Теперь два этих принта в одну строку, потому что знак переноса стал ' '.")

print("======================================================================")
f = "Конечно ясно."
print(f"Думаю с ф-строкой все ясно: f={f}")

print("======================================================================")
print("Можешь попробовать инпут, Введи что-то:")
a = input()
print(a, "это тип данных ", type(a), "\nДа, это всегда строка((((")
print("======================================================================")
print("Пример:\n"
      "Введи числа (в формате float или int) a и b - стороны прямоугольника:")
a = float(input("a = "))
b = float(input("b = "))
print("Площадь =", a*b)