#Матиматические штучки
import math

f = -3.5
print(f"abs - модуль: f = {f}, abs(f) = {abs(f)}")
print("======================================================================")
print(f"min, max - тут все понятно: min1 = min(1, 2, 3) = {min(1, 2 ,3)}, max2 = max(1, 2, 3) = {max(1, 2 ,3)}")
print("======================================================================")
print(f"pow - степень: pow1 = pow(3, 2) = {pow(3, 2)}")
print("======================================================================")
print(f"round - округление: x = round(0.5)={round(0.5)}, y = round(1.5) = {round(1.5)}, использовать осторожно, потому что не понятно как это работает с 5 десятых")
print(f"Кстати раунд можно задавать точность округления: round(3.123123, 2) = {round(3.123123, 2)}")
print(f"Можно даже округлять до десятков, сотен и тд используя минус:\n"
      f"round(3232.1 -1) = {round(3232.1, -1)}\n"
      f"round(3232.1 -2) = {round(3232.1, -2)}\n"
      f"round(3232.1 -3) = {round(3232.1, -3)}")
print("======================================================================")
print("По сути можно вообще отбросить дробную часть, если просто использовать int():")
f = 3.3
print(f"f={f}, int(f)={int(f)}")
print("======================================================================")
print(f"Много матиматики в модуле math., который можно добавить через include math. Например: math.sqrt(9) = {math.sqrt(9)}")
print("======================================================================")
print("про комплексные числа ничего не узнавал, ну и лажно :)")