#Числовые типы данных

print("int - целые, float - вещественные, complex - комплексные числа")
print("======================================================================")

print("Операции над числами: + - / * и % получить остаток от деления и ** возвести в степень и // деление с округлением к наименьшему целому")

print("Принцип работы операторов:\n "
      
      "a = 5 + 5,\n"
      
      "Два объекта, хранящие 5 и 5, не содежат ссылок на них. После сложения будет создан новый объект 10, \n"
      "а объекты 5 и 5 будут удалены сборщиком мусора. Переменной a будет присвоена ссылка на объект, хранящий 10.")

print("======================================================================")
print(f"При делении целых или/и вещественных типов всегда получается вещесвтенное: f={1/3.2} x={2/4} z={2.2/1.1}")