# Переменные:
a = 7
b = a
print("a =",a, "b =", b, " a и b ссылаются на объект хранящий число 7, дублируется только ссылка на объект")

print("======================================================================")
b = 12
print("b =", b)
b = "skibidi"
print("b =", b, " создан новый объект и b ссылается на него")

print("======================================================================")
a = b = c = 12
print("id(a)=id(c)=id(b)=", id(a))
print(id(a), id(b), id(c), "ссылки на один объект")

print("======================================================================")
print("type() - для определения типа данных объекта на который ссылается переменная")
x = "skibidi"
print("x =", x, "type(x) =", type(x))

print("======================================================================")
arg = 12
Arg = 2
print("Все символы переменных имеют значение: arg != Arg\narg = ", arg, "Arg =",Arg)

print("======================================================================")
print("Вот все слова которые не могут быть переменными не знаю заячем но пусть:\n"
+ "False               class               from                or\n"
+"None                continue            global              pass\n"
+"True                def                 if                  raise\n"
+"and                 del                 import              return\n"
+"as                  elif                in                  try\n"
+"assert              else                is                  while\n"
+"async               except              lambda              with\n"
+"await               finally             nonlocal            yield\n"
+"break               for                 not                 ")
print("и не смей использовать имена функций в качестве переменных!!!!")
print("======================================================================")